/*
Создать классы и интерфейсы для разных животных

 - все животные имеют общие свойства - для простоты пусть будет только одно такое свойство String name
 - некоторые животные умеют плавать - имеют метод swim() - пусть просто выводит строку "i'm swimming"
 - некоторые животные умеют летать - имеют метод fly() - пусть просто выводит строку "i'm flying"
 - некоторые животные умеют петь - имеют метод sing() - пусть разные животные выводят разную строку, например кот будет выводить "meow"

опиши следующих животных - кот(поёт), утка(поёт плавает и летает), рыба(только плавает), муха (только летает)

 */

/*abstract class Animals {
    String name;

    public static void main(String[] args) {
        Fish fish1 = new Fish();
        System.out.println(fish1.toString(fish1));
        Muha muha1 = new Muha();
    }
}
interface Swimmer {
    String swim();
}
class Fish extends Animals implements Swimmer {
    public String swim() {
        return "i'm swimming";
    }
}

interface Flyer {
    String fly();
}
class Muha extends Animals implements Flyer {
    public String fly() {
        return "i'm flying";
    }
}*/


